; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v3 ?v1)
             (pred_8 ?v5 ?v13)
             (pred_7 ?v3 ?v13)
             (pred_10 ?v2 ?v3 )
	     (pred_9 ?v3)
             (pred_5 ?v11)
             (pred_3 ?v5)
             (pred_2 ?v13)
             (pred_12 ?v3)
             (pred_4 ?v5)
             (pred_6 ?v3)
             (pred_11 ))



(:action op_3
:parameters (?v12 ?v9 ?v4 ?v8)
:precondition (and (pred_5 ?v12) (pred_5 ?v9) (pred_3 ?v4) (pred_2 ?v8)
          (pred_1 ?v12 ?v9) (pred_8 ?v4 ?v8)
                   (pred_7 ?v9 ?v8) (pred_9 ?v12) 
                   (pred_12 ?v9) (pred_4 ?v4))
:effect (and  (pred_6 ?v9) (not (pred_12 ?v9))))


(:action op_1
:parameters (?v12 ?v6)
:precondition (and (pred_5 ?v12) (pred_5 ?v6)
               (pred_9 ?v12) (pred_1 ?v12 ?v6) (pred_6 ?v6))
:effect (and (pred_9 ?v6) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v4)
:precondition (and (pred_5 ?v12) (pred_3 ?v4) 
                  (pred_9 ?v12) (pred_10 ?v4 ?v12) (pred_11 ))
:effect (and (pred_4 ?v4)
   (not (pred_10 ?v4 ?v12)) (not (pred_11 ))))


(:action op_4
:parameters (?v12 ?v10 ?v7)
:precondition (and (pred_5 ?v12) (pred_3 ?v10) (pred_3 ?v7)
                  (pred_9 ?v12) (pred_4 ?v7) (pred_10 ?v10 ?v12))
:effect (and (pred_4 ?v10) (pred_10 ?v7 ?v12)
        (not (pred_4 ?v7)) (not (pred_10 ?v10 ?v12))))

(:action op_2
:parameters (?v12 ?v4)
:precondition (and (pred_5 ?v12) (pred_3 ?v4) 
                  (pred_9 ?v12) (pred_4 ?v4))
:effect (and (pred_11 ) (pred_10 ?v4 ?v12) (not (pred_4 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_24 obj_27 obj_21 obj_19 obj_12 obj_31 obj_17 obj_15 obj_10 obj_20 obj_08 obj_32 obj_16 obj_23 obj_14 obj_04 obj_30 obj_22 obj_05 obj_26 obj_13 obj_11 obj_01 obj_18 obj_29
    obj_28 obj_09 obj_02
    obj_03 obj_07 obj_06 obj_25
    )

    (:init
       (pred_11)

       (pred_5 obj_24)
       (pred_5 obj_27)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_12)
       (pred_5 obj_31)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_32)
       (pred_5 obj_16)
       (pred_5 obj_23)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_30)
       (pred_5 obj_22)
       (pred_5 obj_05)
       (pred_5 obj_26)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_29)
       (pred_2 obj_28)
       (pred_2 obj_09)
       (pred_2 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_25)

       (pred_1 obj_24 obj_31)
       (pred_1 obj_24 obj_27)
       (pred_1 obj_27 obj_17)
       (pred_1 obj_27 obj_21)
       (pred_1 obj_27 obj_24)
       (pred_1 obj_21 obj_15)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_27)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_19 obj_12)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_19)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_31 obj_17)
       (pred_1 obj_31 obj_24)
       (pred_1 obj_17 obj_32)
       (pred_1 obj_17 obj_15)
       (pred_1 obj_17 obj_27)
       (pred_1 obj_17 obj_31)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_15 obj_10)
       (pred_1 obj_15 obj_21)
       (pred_1 obj_15 obj_17)
       (pred_1 obj_10 obj_23)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_10 obj_15)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_08 obj_04)
       (pred_1 obj_08 obj_32)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_32 obj_30)
       (pred_1 obj_32 obj_16)
       (pred_1 obj_32 obj_17)
       (pred_1 obj_32 obj_08)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_23)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_32)
       (pred_1 obj_23 obj_05)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_23 obj_10)
       (pred_1 obj_23 obj_16)
       (pred_1 obj_14 obj_26)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_04 obj_30)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_30 obj_11)
       (pred_1 obj_30 obj_22)
       (pred_1 obj_30 obj_32)
       (pred_1 obj_30 obj_04)
       (pred_1 obj_22 obj_01)
       (pred_1 obj_22 obj_05)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_30)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_05 obj_26)
       (pred_1 obj_05 obj_23)
       (pred_1 obj_05 obj_22)
       (pred_1 obj_26 obj_29)
       (pred_1 obj_26 obj_14)
       (pred_1 obj_26 obj_05)
       (pred_1 obj_13 obj_11)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_11 obj_30)
       (pred_1 obj_11 obj_13)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_22)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_18 obj_29)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_29 obj_26)
       (pred_1 obj_29 obj_18)
       (pred_12 obj_23)
       (pred_12 obj_29)
       (pred_12 obj_26)
       (pred_12 obj_31)
       (pred_7  obj_23 obj_28)
       (pred_7  obj_29 obj_09)
       (pred_7  obj_26 obj_02)
       (pred_7  obj_31 obj_09)
       (pred_6 obj_24)
       (pred_6 obj_27)
       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_6 obj_12)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_10)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_32)
       (pred_6 obj_16)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_30)
       (pred_6 obj_22)
       (pred_6 obj_05)
       (pred_6 obj_13)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_18)

       (pred_8  obj_03 obj_28)
       (pred_8  obj_07 obj_09)
       (pred_8  obj_06 obj_02)
       (pred_8  obj_25 obj_09)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_25 obj_19)
       (pred_9 obj_27)
    )

    (:goal (and
       (pred_10 obj_03 obj_24)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_25 obj_29)
    ))
(:constraints
  (always (not (pred_9 obj_21)))
)
)

; plan
1. (op_1 obj_27 obj_17)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_17)
   goals met: 0 of 3
2. (op_1 obj_17 obj_32)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_32)
   goals met: 0 of 3
3. (op_1 obj_32 obj_16)
   deleted: (pred_9 obj_32)
   added: (pred_9 obj_16)
   goals met: 0 of 3
4. (op_1 obj_16 obj_22)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_22)
   goals met: 0 of 3
5. (op_1 obj_22 obj_01)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_01)
   goals met: 0 of 3
6. (op_5 obj_01 obj_07)
   deleted: (pred_10 obj_07 obj_01) (pred_11)
   added: (pred_4 obj_07)
   goals met: 0 of 3
7. (op_1 obj_01 obj_18)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_18)
   goals met: 0 of 3
8. (op_3 obj_18 obj_29 obj_07 obj_09)
   deleted: (pred_12 obj_29)
   added: (pred_6 obj_29)
   goals met: 0 of 3
9. (op_1 obj_18 obj_05)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_05)
   goals met: 0 of 3
10. (op_1 obj_05 obj_22)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_22)
   goals met: 0 of 3
11. (op_1 obj_22 obj_16)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_16)
   goals met: 0 of 3
12. (op_1 obj_16 obj_15)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_15)
   goals met: 0 of 3
13. (op_4 obj_15 obj_03 obj_07)
   deleted: (pred_4 obj_07) (pred_10 obj_03 obj_15)
   added: (pred_4 obj_03) (pred_10 obj_07 obj_15)
   goals met: 0 of 3
14. (op_1 obj_15 obj_10)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_10)
   goals met: 0 of 3
15. (op_3 obj_10 obj_23 obj_03 obj_28)
   deleted: (pred_12 obj_23)
   added: (pred_6 obj_23)
   goals met: 0 of 3
16. (op_2 obj_10 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_11) (pred_10 obj_03 obj_10)
   goals met: 0 of 3
17. (op_1 obj_10 obj_15)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_15)
   goals met: 0 of 3
18. (op_5 obj_15 obj_07)
   deleted: (pred_10 obj_07 obj_15) (pred_11)
   added: (pred_4 obj_07)
   goals met: 0 of 3
19. (op_1 obj_15 obj_10)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_10)
   goals met: 0 of 3
20. (op_1 obj_10 obj_23)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_23)
   goals met: 0 of 3
21. (op_1 obj_23 obj_14)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_14)
   goals met: 0 of 3
22. (op_2 obj_14 obj_07)
   deleted: (pred_4 obj_07)
   added: (pred_11) (pred_10 obj_07 obj_14)
   goals met: 1 of 3
23. (op_1 obj_14 obj_23)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_23)
   goals met: 1 of 3
24. (op_1 obj_23 obj_10)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_10)
   goals met: 1 of 3
25. (op_1 obj_10 obj_19)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_19)
   goals met: 1 of 3
26. (op_5 obj_19 obj_25)
   deleted: (pred_10 obj_25 obj_19) (pred_11)
   added: (pred_4 obj_25)
   goals met: 1 of 3
27. (op_1 obj_19 obj_10)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_10)
   goals met: 1 of 3
28. (op_1 obj_10 obj_23)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_23)
   goals met: 1 of 3
29. (op_1 obj_23 obj_05)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_05)
   goals met: 1 of 3
30. (op_1 obj_05 obj_18)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_18)
   goals met: 1 of 3
31. (op_1 obj_18 obj_29)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_29)
   goals met: 1 of 3
32. (op_2 obj_29 obj_25)
   deleted: (pred_4 obj_25)
   added: (pred_11) (pred_10 obj_25 obj_29)
   goals met: 2 of 3
33. (op_1 obj_29 obj_18)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_18)
   goals met: 2 of 3
34. (op_1 obj_18 obj_05)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_05)
   goals met: 2 of 3
35. (op_1 obj_05 obj_23)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_23)
   goals met: 2 of 3
36. (op_1 obj_23 obj_10)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_10)
   goals met: 2 of 3
37. (op_5 obj_10 obj_03)
   deleted: (pred_10 obj_03 obj_10) (pred_11)
   added: (pred_4 obj_03)
   goals met: 2 of 3
38. (op_1 obj_10 obj_15)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_15)
   goals met: 2 of 3
39. (op_1 obj_15 obj_17)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_17)
   goals met: 2 of 3
40. (op_1 obj_17 obj_27)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_27)
   goals met: 2 of 3
41. (op_1 obj_27 obj_24)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_24)
   goals met: 2 of 3
42. (op_2 obj_24 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_11) (pred_10 obj_03 obj_24)
   goals met: 3 of 3
